#+TITLE: My Emacs Config

What should I do with hooks like super star mode?
Evaluating the babel languages is easiest inside the init-org though.

Implement a similar thing with hydra and programming modes (for company / ya snippet)

(profile with esup)


** TODO Get Julia Working with babel  

   The only way to get the following julia babel to evaluate, is to first evalauate:

   #+begin_src elisp
    (load "~/.emacs.d/straight/repos/org/contrib/lisp/ob-julia.el")
   #+end_src

   #+RESULTS:
   : t

   I need to find a better way to install that with straight.

   #+begin_src julia :results output
    print(3)
   #+end_src

   #+RESULTS:
   : 3

   Getting Julia to work reliably will be tiring.


   Worth noting that I also had this ominuous snippet in my old config:

   #+begin_src 

;;;; Julia LSP
;; This is needed for Julia LSP otherwise it crashes
;; https://github.com/non-Jedi/lsp-julia/issues/35
(setq lsp-enable-folding t)




   #+end_src
